export const poseInstructions = {
    Tree: [
        '1. 山式站立，双脚并拢或稍分开。',
        '2. 提起左脚跟，脚趾着地，重心放在右脚。',
        '3. 眼睛注视固定的一点有助于稳定姿势。抬起左脚，握着脚踝，脚底贴着右大腿内侧，脚跟在舒适的范围内靠近腹股沟，脚趾朝下。保持髋部朝向正前方，左膝朝着左外侧。',
        '4. 在胸前合掌。',
        '5. 站稳以后，双臂慢慢高举过头，保持肩膀下沉。手肘可以伸直或弯曲。躯干从腰往上延伸，轻轻收腹。平稳均匀地呼吸，保持10～60秒钟。',
        '6. 合掌回到胸前，左脚放回地上，两臂放到体侧。',
        '7. 换边重复。',
        '8. 放松，体重均匀地分布在双脚上。',],
    Cobra: [
        '1. 选择俯卧的姿势，下颌点地，双臂自然放于体侧，双手握空拳。',
        '2. 曲手肘，双手掌心向下，指尖向前，放于胸的两侧，下巴抵于垫子上。',
        '3. 第三步：吸气，慢慢抬高上身，尽量将上半身与地面保持垂直，伸直双臂，视线看向上方，尽量太高下巴。',
        '4. 呼气，曲手肘，上半身慢慢地还原于初始姿势。'
    ],
    Dog: [
        '1. 吸气，双手掌心推地，将身体向上推离地面，肩膀向后向下，折叠髋，将臀部推向天空，两手臂向前伸到最远，拉长脊背。',
        '2. 让右髋向前左髋向后，来摆正你的髋部。呼气，上半身慢慢向前屈，让背部与地面平行，双腿伸展，保持姿势10秒。',
        '3. 呼气时，手掌压地坐骨向后拉，把侧腰伸展开，肩膀有一种外旋的力并向上提，远离耳朵，让胸腔去找膝盖的方向，腹肌收紧，尾骨内卷，双腿大腿面有种向后推的力量，小腿向内夹，双脚尝试着向下踩，臀部向上提;眼睛看向双脚之间的方向;柔韧度不好，可以屈膝踮起脚尖，后脚跟离地练习，注意肩膀要放松。停留此式中三到五个呼吸。',
        '4. 最后一次吸气，呼气时，膝盖落地，退出下犬式。'

    ],
    Chair: [
        '1、山式站立准备.',
        '2、吸气、双手臂像上伸展；（肩膀僵硬者可以将双手前平举）.',
        '3、呼气，微屈膝盖向下蹲（膝盖不超过脚尖，卷收尾骨，重心在脚掌中间），保持3-5个呼吸。',
        '4、吸气、伸直膝盖直立；',
        '5、呼气，双手还原体侧。（可重复几组练习）'
    ],
    Warrior: [
        '1. 双腿打开与髋同宽。吸气时将双臂两侧上举，同时右腿向后略抬起，使脚离开地板，但不要弯曲右腿。',
        '2. 吐气时将身体向前倾，直到你的身体和支撑腿成为T字形。然后保持5个呼吸。',
        '（注意:有的同学可能还没有掌握平衡，这个时候，你要做一件事情。就是不论你的身体向前倾多少度，你的腿就应该向后抬多少度。你的身体和腿应该保持在一条线上。记住你的身体向前倾不能超于90度，腿也不要超过90度。 初学者可以双手展开，微曲腿保持身体平衡 )',
        '3. 吸气，先抬一点头部，由颈椎开始一点点直立。切不可直接动用腰部力量。',
        '4. 吐气双臂放松下落，准备反侧。'
    ],
    Traingle: [
        '1. 双脚打开四点距离（三个肩宽）双手打开（双手侧平举），右脚向外打开90度，左脚微内扣，深吸气。',
        '2. 呼气，身体转向右侧，再一次脊柱伸展。呼气，上体往前往下， 落下左手在右脚的内侧，右手向上抬起，垂直地面，眼睛看向右手手指尖。',
        '3. 保持脊柱的伸展，注意膝盖绷直，深吸气，头部回正，落下右手。',
        '4. 深吸气，脊柱延展，屈膝，双手打开，脚掌轻推地，身体慢慢的回正，收回双脚，呼气，放松，做反方向。',
        '5. 双手打开，左脚打开90度，右脚微内扣，深吸气。',
        '6. 呼气，身体转向左侧，再次脊柱延展，呼气，上体向往前往下，落下右手掌在左脚内侧，左手向上抬起。',
        '7. 深吸气，头部回正，左手落于左脚外侧，指腹推地，脊柱延展。',
        '8. 屈膝，双手打开，脚掌轻推地，让身体慢慢的直立起来，身体还原体前，左脚尖收回，放松身体。'

    ],
    Shoulderstand: [
        '1.仰卧，双手放于身体两侧掌心向上，胸骨上提高，双肩下压，背部不离开地面。',
        '2.呼气，弯曲双膝在躯干不移动的情况下，再呼气将臀部和髋部抬离地面。将膝盖带向胸部。',
        '3.将双手放于髋部，肘部用力下压毯子。上提躯干直至臀部与地面垂直。将双膝带向头部。',
        '4.双手下滑至背的中间，使手掌覆盖双肾部位，向上抬躯干、髋部以及膝盖，直到胸部触下巴，均匀呼吸。（膝盖指向上方）',
        '5.双手按入背部，从腋窝到脚趾向上伸直，伸展整个身体。脊柱必须挺直保持此体式2-3分钟。',
        '6.呼气，弯曲膝盖。将大腿带向胃部区域，再将身体放回地面。'
    ]

}


export const POINTS = {
    NOSE: 0,
    LEFT_EYE: 1,
    RIGHT_EYE: 2,
    LEFT_EAR: 3,
    RIGHT_EAR: 4,
    LEFT_SHOULDER: 5,
    RIGHT_SHOULDER: 6,
    LEFT_ELBOW: 7,
    RIGHT_ELBOW: 8,
    LEFT_WRIST: 9,
    RIGHT_WRIST: 10,
    LEFT_HIP: 11,
    RIGHT_HIP: 12,
    LEFT_KNEE: 13,
    RIGHT_KNEE: 14,
    LEFT_ANKLE: 15,
    RIGHT_ANKLE: 16,
}

export const keypointConnections = {
    nose: ['left_ear', 'right_ear'],
    left_ear: ['left_shoulder'],
    right_ear: ['right_shoulder'],
    left_shoulder: ['right_shoulder', 'left_elbow', 'left_hip'],
    right_shoulder: ['right_elbow', 'right_hip'],
    left_elbow: ['left_wrist'],
    right_elbow: ['right_wrist'],
    left_hip: ['left_knee', 'right_hip'],
    right_hip: ['right_knee'],
    left_knee: ['left_ankle'],
    right_knee: ['right_ankle']
}